public class Main {

    public static void main(String[] args) {

        int amount = 1111; // Стоимость билета
        int bonus = (amount / 20);
        System.out.println((bonus) + " Накопленные мили");

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}
